Revit 2024 API
ViewSchedule.IsDataOutOfDate Method
 Indicates whether the schedule data is out of date.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsDataOutOfDate()
Visual Basic
Public Function IsDataOutOfDate As Boolean
Visual C++
public:
bool IsDataOutOfDate()
Return Value
 True if the schedule data is out of date, false otherwise.
Remarks
 To improve performance, the ViewSchedule may contain TableSections that are only updated on demand. For example, the body section of a schedule is not updated when the ViewSchedule is closed. In this case, you need to call RefreshData to avoid getting the stale data.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace